hello-world.yml
config:
  target: https://www.artillery.io
  phases:
    - duration: 5
      arrivalRate: 2
      maxVusers: 10
      name: The attack!
  # Enable the Playwright engine:
  engines:
    playwright:
      launchOptions:
        headless: true
  processor: "./flows.js"
scenarios:
  - engine: playwright
    flowFunction: "helloFlow"
    flow: []